function triangleOfNumbers(num){


    for (let row=1;row<=num;row++){ // цикъл който да се грижи за колонките

        let printLine=''; /* празен стринг защото искаме числото на което се намираме в момента, искаме толкова пъти да добави
        себе си и Space накрая, и след като свърши вътрешния цикъл да създава редовете да го изкараме на конзолата еднократно, 
        след което да променим числото и да идем на новия ред и отново и отново */

        for (let col=1;col<=row;col++){
            printLine+=`${row} ` /*ъпейдтваме printLine със стойността на row в интерполация, за да може всеки път като се завърти
            този цикъл да съдържа в себе си хем стойността на row хем Space и да ги реди на един ред, знам че е забъркано?? */
        }
        console.log(printLine);
    }

}
triangleOfNumbers(5)
